bench/results/endpoint-sweep-20260427-044222/hyper-echo1m.h2load.txt
starting benchmark...
spawning thread #0: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #1: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #2: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #3: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
Warm-up started for thread #3.
Warm-up started for thread #0.
Warm-up started for thread #1.
Warm-up started for thread #2.
progress: 50% of clients started
progress: 100% of clients started
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Warm-up phase is over for thread #1.
Main benchmark duration is started for thread #1.
Warm-up phase is over for thread #2.
Main benchmark duration is started for thread #2.
Warm-up phase is over for thread #3.
Main benchmark duration is started for thread #3.
Main benchmark duration is over for thread #0. Stopping all clients.
Main benchmark duration is over for thread #Stopped all clients for thread #0
1. Stopping all clients.
Stopped all clients for thread #1
Main benchmark duration is over for thread #2. Stopping all clients.
Stopped all clients for thread #2
Main benchmark duration is over for thread #3. Stopping all clients.
Stopped all clients for thread #3

finished in 9.00s, 2396.12 req/s, 2.34GB/s
requests: 19169 total, 19169 started, 19169 done, 19169 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 19171 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 18.73GB (20112708166) total, 211.46KB (216537) headers (space savings 84.24%), 20.97GB (22512615424) data
                     min         max         mean         sd        +/- sd
time for request:     2.60ms    446.45ms     32.82ms     14.66ms    98.19%
time for connect:        0us         0us         0us         0us     0.00%
time to 1st byte:        0us         0us         0us         0us     0.00%
req/s           :     271.59      314.33      299.49       13.32    75.00%