bench/results/endpoint-sweep-20260427-044222/hyper-tiny.h2load.txt
starting benchmark...
spawning thread #0: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #1: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #2: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #3: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
Warm-up started for thread #0.
Warm-up started for thread #3.
Warm-up started for thread #1.
progress: 50% of clients started
progress: 100% of clients started
Warm-up started for thread #2.
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Warm-up phase is over for thread #1.
Main benchmark duration is started for thread #1.
Warm-up phase is over for thread #3.
Warm-up phase is over for thread #Main benchmark duration is started for thread #3.
2.
Main benchmark duration is started for thread #2.
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0
Main benchmark duration is over for thread #1. Stopping all clients.
Stopped all clients for thread #1
Main benchmark duration is over for thread #2. Stopping all clients.
Stopped all clients for thread #2
Main benchmark duration is over for thread #3. Stopping all clients.
Stopped all clients for thread #3

finished in 9.00s, 326851.88 req/s, 8.10MB/s
requests: 2614815 total, 2614815 started, 2614815 done, 2614815 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 2614815 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 64.84MB (67986662) total, 16.80MB (17615050) headers (space savings 89.65%), 5.60MB (5871070) data
                     min         max         mean         sd        +/- sd
time for request:       20us      4.27ms       226us       101us    67.44%
time for connect:        0us         0us         0us         0us     0.00%
time to 1st byte:        0us         0us         0us         0us     0.00%
req/s           :   40758.23    40953.47    40855.65       71.53    62.50%