bench/results/endpoint-sweep-20260427-044222/trillium-10m.h2load.txt
starting benchmark...
spawning thread #0: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #1: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #2: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #3: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
Warm-up started for thread #3.
Warm-up started for thread #1.
Warm-up started for thread #0.
Warm-up started for thread #2.
progress: 50% of clients started
progress: 100% of clients started
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
Warm-up phase is over for thread #3.
Main benchmark duration is started for thread #3.
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Warm-up phase is over for thread #1.
Main benchmark duration is started for thread #1.
Warm-up phase is over for thread #2.
Main benchmark duration is started for thread #2.
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0
Main benchmark duration is over for thread #3. Stopping all clients.
Stopped all clients for thread #3
Main benchmark duration is over for thread #1. Stopping all clients.
Stopped all clients for thread #1
Main benchmark duration is over for thread #2. Stopping all clients.
Stopped all clients for thread #2

finished in 9.04s, 799.25 req/s, 7.80GB/s
requests: 6394 total, 6394 started, 6394 done, 6394 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 6384 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 62.38GB (66976419475) total, 486.23KB (497904) headers (space savings 40.00%), 70.10GB (75273568103) data
                     min         max         mean         sd        +/- sd
time for request:     5.82ms       2.96s     96.57ms    163.59ms    96.25%
time for connect:        0us         0us         0us         0us     0.00%
time to 1st byte:        0us         0us         0us         0us     0.00%
req/s           :      33.72      143.08       99.70       34.89    75.00%