bench/results/endpoint-sweep-20260427-044222/trillium-echo64.h2load.txt
starting benchmark...
spawning thread #0: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #1: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #2: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #3: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
Warm-up started for thread #1.
Warm-up started for thread #0.
Warm-up started for thread #3.
Warm-up started for thread #2.
progress: 50% of clients started
progress: 100% of clients started
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Warm-up phase is over for thread #1.
Main benchmark duration is started for thread #1.
Warm-up phase is over for thread #2.
Main benchmark duration is started for thread #2.
Warm-up phase is over for thread #3.
Main benchmark duration is started for thread #3.
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0
Main benchmark duration is over for thread #2. Stopping all clients.
Stopped all clients for thread #2
Main benchmark duration is over for thread #1. Stopping all clients.
Stopped all clients for thread #1
Main benchmark duration is over for thread #3. Stopping all clients.
Stopped all clients for thread #3

finished in 9.00s, 209997.62 req/s, 38.34MB/s
requests: 1679981 total, 1679981 started, 1679981 done, 1679981 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 1679981 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 306.74MB (321638070) total, 117.10MB (122789160) headers (space savings 40.37%), 115.30MB (120900096) data
                     min         max         mean         sd        +/- sd
time for request:       53us      2.84ms       354us       111us    70.73%
time for connect:        0us         0us         0us         0us     0.00%
time to 1st byte:        0us         0us         0us         0us     0.00%
req/s           :   25665.25    26726.98    26249.28      435.08    62.50%